controllers/OrderController.php

SELECT * FROM "order" WHERE "ord_id"='2'
---
    protected function findModel($ord_id)
    {
        if (($model = Order::findOne(['ord_id' => $ord_id])) !== null) {